02-01-expressoes-primitivas.org
#+setupfile: static/setupfile.org
#+html_link_up: 02-sintaxe.html
#+title: Expressões primitivas

Majestic Lisp é uma linguagem cuja construção se inicia por seus tipos
mais básicos  de dados. Por  isso, é pertinente que  comecemos falando
dos tipos como elementos mais básicos da linguagem.

#+index: expressões primitivas
As expressões analisadas a seguir  são /expressões primitivas/, ou seja,
os  tipos  mais  básicos  de  expressões que  podem  ser  escritas  na
linguagem.

** Números

Expressões  numéricas   representam  /símbolos/  especiais,   que  serão
tratados como sendo  do tipo básico dos /números/.  Por exemplo, podemos
representar  números  inteiros  (matematicamente,  parte  do  conjunto
$\mathbb{Z}$) diretamente, com ou sem um sinal negativo em sua frente.

#+begin_src majestic
-1
#+end_src

#+RESULTS[8ccad19d075d556a4979604c589b03fc55895f45]:
: -1

#+begin_src majestic
23
#+end_src

#+RESULTS[0f8144d3698f400852c398bc548a08919a2175cc]:
: 23

Apesar  de os  /números/ comporem  um  único grande  tipo, temos  alguns
desdobramentos   de    subtipos   nos   mesmos,   por    questões   de
praticidade.    O   exemplo    acima   demonstra    números   /inteiros/
(~integer~). Abaixo,  podemos ver  um exemplo de  números do  tipo /ponto
flutuante/  (~float~). Esse  subtipo  numérico é  capaz  de armazenar  um
número  onde  casas  decimais   possam  ser  discriminadas,  sendo  um
simulacro de números pertencentes ao conjunto dos números reais ($\mathbb{R}$).

#+begin_src majestic
0.5
#+end_src

#+RESULTS[d0be86fb510711843c02d08e1e7f94067bfde081]:
: 0.5

#+begin_src majestic
1.0
#+end_src

#+RESULTS[c075c855dd23d14faf81f97654a1bdcfcd260192]:
: 1.0

#+begin_src majestic
.125
#+end_src

#+RESULTS[83d89ef7c66ed56a611ee791473a09573fae60c5]:
: 0.125

#+begin_src majestic
2.
#+end_src

#+RESULTS[256426af955a9eac100a823c89defe06574d5de6]:
: 2.0

Um  ~float~ sempre  será escrito  com um  único /ponto/  em alguma  parte,
geralmente  dividindo a  parte  inteira  e a  parte  decimal do  ponto
flutuante. Caso o  ponto esteja no início, Majestic Lisp  assume que a
/parte inteira/ do número seja nula; caso esteja no final, assume-se que
a /parte decimal/ do número seja nula.

Quando a exatidão no cálculo  com um número decimal for imprescindível
para um cálculo, pode-se usar esse número na forma de /fração/.

As /frações/ de Majestic Lisp são  também um simulacro de outro conjunto
da Matemática,  o conjunto dos números  racionais ($\mathbb{Q}$). Esse
conjunto é  normalmente definido  como qualquer  número que  possa ser
escrito com  um /numerador/  e um /denominador/  que sejam  inteiros ($\in
\mathbb{Z}$). Para completar, o /denominador/ não pode valer zero:

\begin{equation*}
        \mathbb{Q} = \left\{\frac{p}{q}\, \mid \, p \in \mathbb{Z}, q \in \mathbb{Z}^{*} \right\}
\end{equation*}

Isso  é muito  importante  para a  sintaxe de  Majestic  Lisp, já  que
nos faz  entender que não  é possível construir partes  individuais de
uma fração com um subtipo numérico que não seja ~integer~.

Frações em Majestic  Lisp são representadas usando um  caractere ~/~ que
divide  o  /numerador/ e  o  /denominador/,  respectivamente. Nenhuma  das
partes pode ser omitida, mesmo quando o numerador for nulo.

Quando   uma    fração   não    estiver   descrita   em    sua   forma
simplificada[fn:1],  Majestic tratará  essa situação  e realizará  tal
conversão de valor equivalente quando for possível.

#+begin_src majestic
1/2
#+end_src

#+RESULTS[98f7b8e74ea61d3216578ff324137931bc9292ea]:
: 1/2

#+begin_src majestic
4/6
#+end_src

#+RESULTS[694e667edff4abafc1927c85e1035af07db7f7d9]:
: 2/3

O último subtipo  de um número é o /número  complexo/. Números complexos
são quaisquer números que  possam ser escritos na forma $z  = a + bi$,
onde $a$ é chamado de parte /real/,  e $b$ é chamado de parte /imaginária/
do número[fn:2].

\begin{equation*}
        \mathbb{C} = \left\{ z = a + bi \mid a, b \in \mathbb{R} \right\}
\end{equation*}

Como podemos  ver, $a$ e  $b$ podem ser números  reais ($\mathbb{R}$),
mas  também   podem  pertencer   a  quaisquer  de   seus  subconjuntos
($\mathbb{N}$, $\mathbb{Z}$ e até mesmo $\mathbb{Q}$).

Essa observação  é importante  para os números  do subtipo  ~complex~ de
Majestic Lisp.  Nela, um  número complexo  pode ser  escrito com  um ~J~
separando duas partes do  número[fn:3], que devem obrigatoriamente ser
descritas. Do lado esquerdo, teremos a  parte /real/ do número; do outro
lado, teremos a parte /imaginária/.

Por se  tratar de um  número com  potenciais subtipos, o  ~complex~ pode
possuir qualquer  número que se  enquadre nos subtipos  anteriores, em
suas partes /real/ ou /imaginária/. Mas essas partes precisam ser escritas
mesmo quando forem nulas.

#+begin_src majestic
2J5
#+end_src

#+RESULTS[9099d19d21f6102c7e710cfe993af4e3dc85b6eb]:
: 2J5

#+begin_src majestic
-3J6/4
#+end_src

#+RESULTS[c79f77daefbe5134ab53c3d24b28a450a317b32e]:
: -3J3/2

#+begin_src majestic
0J1
#+end_src

#+RESULTS[c07f02f4594da31e9eacb999898c96b45b05e515]:
: 0J1

Os  exemplos acima  descrevem, respectivamente,  os números  complexos
$2+5i$, $-3+{}^{3}/_{2}\,i$ e $0+1i$, tal  que este último poderia ser
escrito simplesmente como $i$.

** Caracteres

Outro  tipo  básico  de   Majestic  Lisp  envolve  /caracteres/,  também
conhecidos como ~char~.  Um ~char~ pode ser  informado diretamente através
de sua escrita, precedida pelos caracteres ~#\~, que indicam o uso de um
caractere.

#+begin_src majestic
#\a
#+end_src

#+RESULTS[08eeaff1041094b3de786912f72dc5c5e06fda4c]:
: #\a

#+begin_src majestic
#\C
#+end_src

#+RESULTS[94fbbd350e1298b3ec9249d04aeb34a3a5f4ea3a]:
: #\C

Certos caracteres não possuem representação textual, e portanto, podem
ser  escritos  diretamente  através  de   uma  forma  textual  que  os
lembre. Por exemplo, o caractere  de /campainha/ (/bell/) pode ser escrito
como ~#\bel~.

