02-01-expressoes-primitivas.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="pt-br" xml:lang="pt-br">
<head>
<!-- 2022-10-24 seg 00:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Expressões primitivas</title>
<meta name="author" content="Lucas S. Vieira" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./main.css" />
<link rel="stylesheet" type="text/css" href="./syntax.css" />
<link id="theme-css" rel="stylesheet" type="text/css" href="./dark-theme.css" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta property="og:image" content="../img/cat-i-mage.jpg">
<meta name="theme-color" content="#14171e">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="02-sintaxe.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Expressões primitivas</h1>
<p>
Majestic Lisp é uma linguagem cuja construção se inicia por seus tipos
mais básicos  de dados. Por  isso, é pertinente que  comecemos falando
dos tipos como elementos mais básicos da linguagem.
</p>

<p>
As expressões analisadas a seguir  são <i>expressões primitivas</i>, ou seja,
os  tipos  mais  básicos  de  expressões que  podem  ser  escritas  na
linguagem.
</p>

<div id="outline-container-orgb0cd712" class="outline-2">
<h2 id="orgb0cd712"><span class="section-number-2">1.</span> Números</h2>
<div class="outline-text-2" id="text-1">
<p>
Expressões  numéricas   representam  <i>símbolos</i>  especiais,   que  serão
tratados como sendo  do tipo básico dos <i>números</i>.  Por exemplo, podemos
representar  números  inteiros  (matematicamente,  parte  do  conjunto
\(\mathbb{Z}\)) diretamente, com ou sem um sinal negativo em sua frente.
</p>

<div class="org-src-container">
<pre class="src src-majestic">-1
</pre>
</div>

<pre class="example">
-1
</pre>


<div class="org-src-container">
<pre class="src src-majestic">23
</pre>
</div>

<pre class="example">
23
</pre>


<p>
Apesar  de os  <i>números</i> comporem  um  único grande  tipo, temos  alguns
desdobramentos   de    subtipos   nos   mesmos,   por    questões   de
praticidade.    O   exemplo    acima   demonstra    números   <i>inteiros</i>
(<code>integer</code>). Abaixo,  podemos ver  um exemplo de  números do  tipo <i>ponto
flutuante</i>  (<code>float</code>). Esse  subtipo  numérico é  capaz  de armazenar  um
número  onde  casas  decimais   possam  ser  discriminadas,  sendo  um
simulacro de números pertencentes ao conjunto dos números reais (\(\mathbb{R}\)).
</p>

<div class="org-src-container">
<pre class="src src-majestic">0.5
</pre>
</div>

<pre class="example">
0.5
</pre>


<div class="org-src-container">
<pre class="src src-majestic">1.0
</pre>
</div>

<pre class="example">
1.0
</pre>


<div class="org-src-container">
<pre class="src src-majestic">.125
</pre>
</div>

<pre class="example">
0.125
</pre>


<div class="org-src-container">
<pre class="src src-majestic">2.
</pre>
</div>

<pre class="example">
2.0
</pre>


<p>
Um  <code>float</code> sempre  será escrito  com um  único <i>ponto</i>  em alguma  parte,
geralmente  dividindo a  parte  inteira  e a  parte  decimal do  ponto
flutuante. Caso o  ponto esteja no início, Majestic Lisp  assume que a
<i>parte inteira</i> do número seja nula; caso esteja no final, assume-se que
a <i>parte decimal</i> do número seja nula.
</p>

<p>
Quando a exatidão no cálculo  com um número decimal for imprescindível
para um cálculo, pode-se usar esse número na forma de <i>fração</i>.
</p>

<p>
As <i>frações</i> de Majestic Lisp são  também um simulacro de outro conjunto
da Matemática,  o conjunto dos números  racionais (\(\mathbb{Q}\)). Esse
conjunto é  normalmente definido  como qualquer  número que  possa ser
escrito com  um <i>numerador</i>  e um <i>denominador</i>  que sejam  inteiros (\(\in
\mathbb{Z}\)). Para completar, o <i>denominador</i> não pode valer zero:
</p>

\begin{equation*}
        \mathbb{Q} = \left\{\frac{p}{q}\, \mid \, p \in \mathbb{Z}, q \in \mathbb{Z}^{*} \right\}
\end{equation*}

<p>
Isso  é muito  importante  para a  sintaxe de  Majestic  Lisp, já  que
nos faz  entender que não  é possível construir partes  individuais de
uma fração com um subtipo numérico que não seja <code>integer</code>.
</p>

<p>
Frações em Majestic  Lisp são representadas usando um  caractere <code>/</code> que
divide  o  <i>numerador</i> e  o  <i>denominador</i>,  respectivamente. Nenhuma  das
partes pode ser omitida, mesmo quando o numerador for nulo.
</p>

<p>
Quando   uma    fração   não    estiver   descrita   em    sua   forma
simplificada<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>,  Majestic tratará  essa situação  e realizará  tal
conversão de valor equivalente quando for possível.
</p>

<div class="org-src-container">
<pre class="src src-majestic">1/2
</pre>
</div>

<pre class="example">
1/2
</pre>


<div class="org-src-container">
<pre class="src src-majestic">4/6
</pre>
</div>

<pre class="example">
2/3
</pre>


<p>
O último subtipo  de um número é o <i>número  complexo</i>. Números complexos
são quaisquer números que  possam ser escritos na forma \(z  = a + bi\),
onde \(a\) é chamado de parte <i>real</i>,  e \(b\) é chamado de parte <i>imaginária</i>
do número<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>.
</p>

\begin{equation*}
        \mathbb{C} = \left\{ z = a + bi \mid a, b \in \mathbb{R} \right\}
\end{equation*}

<p>
Como podemos  ver, \(a\) e  \(b\) podem ser números  reais (\(\mathbb{R}\)),
mas  também   podem  pertencer   a  quaisquer  de   seus  subconjuntos
(\(\mathbb{N}\), \(\mathbb{Z}\) e até mesmo \(\mathbb{Q}\)).
</p>

<p>
Essa observação  é importante  para os números  do subtipo  <code>complex</code> de
Majestic Lisp.  Nela, um  número complexo  pode ser  escrito com  um <code>J</code>
separando duas partes do  número<sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup>, que devem obrigatoriamente ser
descritas. Do lado esquerdo, teremos a  parte <i>real</i> do número; do outro
lado, teremos a parte <i>imaginária</i>.
</p>

<p>
Por se  tratar de um  número com  potenciais subtipos, o  <code>complex</code> pode
possuir qualquer  número que se  enquadre nos subtipos  anteriores, em
suas partes <i>real</i> ou <i>imaginária</i>. Mas essas partes precisam ser escritas
mesmo quando forem nulas.
</p>

<div class="org-src-container">
<pre class="src src-majestic">2J5
</pre>
</div>

<pre class="example">
2J5
</pre>


<div class="org-src-container">
<pre class="src src-majestic">-3J6/4
</pre>
</div>

<pre class="example">
-3J3/2
</pre>


<div class="org-src-container">
<pre class="src src-majestic">0J1
</pre>
</div>

<pre class="example">
0J1
</pre>


<p>
Os  exemplos acima  descrevem, respectivamente,  os números  complexos
\(2+5i\), \(-3+{}^{3}/_{2}\,i\) e \(0+1i\), tal  que este último poderia ser
escrito simplesmente como \(i\).
</p>
</div>
</div>

<div id="outline-container-orgd14f5f6" class="outline-2">
<h2 id="orgd14f5f6"><span class="section-number-2">2.</span> Caracteres</h2>
<div class="outline-text-2" id="text-2">
<p>
Outro  tipo  básico  de   Majestic  Lisp  envolve  <i>caracteres</i>,  também
conhecidos como <code>char</code>.  Um <code>char</code> pode ser  informado diretamente através
de sua escrita, precedida pelos caracteres <code>#\</code>, que indicam o uso de um
caractere.
</p>

<div class="org-src-container">
<pre class="src src-majestic">#\a
</pre>
</div>

<pre class="example">
#\a
</pre>


<div class="org-src-container">
<pre class="src src-majestic">#\C
</pre>
</div>

<pre class="example">
#\C
</pre>


<p>
Certos caracteres não possuem representação textual, e portanto, podem
ser  escritos  diretamente  através  de   uma  forma  textual  que  os
lembre. Por exemplo, o caractere  de <i>campainha</i> (<i>bell</i>) pode ser escrito
como <code>#\bel</code>.
</p>
</div>
</div>
