02-01-expressoes-primitivas.org
** Símbolos e /Quoting/

Antes de falarmos do tipo  mais fundamental (e talvez mais importante)
não apenas de Majestic Lisp, mas  talvez de todos os Lisps, precisamos
falar do processo de /quoting/.

#+index: quoting
/Quoting/, palavra em  Inglês também conhecida como /citação/,  é o nome
que damos ao ato de fornecer certas expressões para o interpretador de
Majestic Lisp,  *sem que o interpretador  efetivamente interprete essas
expressões*.   Em outras  palavras,  é como  fornecer  um valor  "entre
aspas".

O interpretador  de um  dialeto de  Lisp tem a  missão de  receber uma
expressão,  interpretá-la  e assim  retornar  ao  usuário o  valor  da
mesma. Assim, escrever uma expressão como  ~-5~ passa por um processo de
interpretação, em que identifica-se que aquilo  é um número, e o valor
de tal número é retornado ao usuário.

#+begin_src majestic
-5
#+end_src

#+RESULTS[1a58f45f3a40455fc35b1ff694b83135832b7b61]:
: -5

#+index: símbolo
Quando a  expressão em questão  não é um  /número/ ou um  /caractere/, ela
pode ser um  /símbolo/. E normalmente, símbolos  funcionam como /rótulos/:
eles estarão  associados a um /valor/  em algum tipo de  /tabela/ que, por
enquanto, não é muito relevante conhecermos.

#+begin_src majestic
eq
#+end_src

#+RESULTS[a3ec4a94da7adca6225147ba6e264bc27737cc8e]:
: #<function (prim eq (arity (required 2)))>

Quando um /símbolo/ (como ~eq~) é fornecido ao interpretador, este tentará
buscar o valor *associado* a esse  símbolo (nesse caso, uma função, algo
que  conheceremos mais  adiante).  Se o  nosso  objetivo fosse  tratar
apenas do próprio símbolo  ~eq~, então precisaríamos /quotá-lo/, colocando
um apóstrofo antes de escrevê-lo:

#+begin_src majestic
'eq
#+end_src

#+RESULTS[67212dae88a29d266ec89c8f41802ba3d7bc7fc5]:
: eq

Ao  /quotarmos/ um  certo  símbolo  ou um  outro  tipo  de expressão,  o
interpretador  entenderá que  não  deve processar  o conteúdo  daquela
expressão,  mas  sim retorná-la  da  forma  como  está escrita.  Se  a
expressão  quotada  for  um  /símbolo/, portanto,  aquele  símbolo  será
retornado.

*** Símbolos comuns

Símbolos, como já foi dito antes,  operam como /rótulos/ para valores na
linguagem, mas  eles em si  são também um  tipo especial de  valor. Um
símbolo   é  representado,   textualmente,   como   uma  palavra   sem
espaços.

Tratar  símbolos   diretamente  com  valores   frequentemente  exigirá
/quotá-los/, com algumas raras exceções, que veremos em breve.

#+begin_src majestic
'foo
#+end_src

#+RESULTS[453dc97480a4fb78a6b9da7fe45f53595170718d]:
: foo

#+begin_src majestic
'bar
#+end_src

#+RESULTS[3158b70f0c651ce0c184000470d6cb5e519c8e90]:
: bar

Normalmente separamos as "palavras" de  um símbolo com hífens ~-~, sendo
esta uma convenção de quase todos os dialetos de Lisp, algo que também
adotaremos aqui.

#+begin_src majestic
'fulano-de-tal
#+end_src

#+RESULTS[3ec5ec2e22d5ee10e02b61d6a51d43058688b5ce]:
: fulano-de-tal

*** Símbolos autointerpretáveis

Alguns  poucos símbolos  são  /autointerpretáveis/, isto  é, não  exigem
nenhum tipo  de /quoting/, pois  o único valor  associado a eles  é eles
mesmos.

Esses  símbolos (como  ~t~ e  ~nil~) normalmente  possuem uso  especial, e
podem ser considerados como /axiomas/[fn:4] da linguagem.

#+begin_src majestic
t
#+end_src

#+RESULTS[7d796008487e0b7d240e64c204f974fefa95d779]:
: t

#+begin_src majestic
nil
#+end_src

#+RESULTS[ae458b5a22db7b35d65740a69e76aca15fb154c7]:
: nil

~nil~ é o  símbolo geral para denotar  /falsidade/ ou o fim  de uma /lista/,
que veremos em uma  situação mais adiante. Já o símbolo  ~t~ é o símbolo
específico para denotar a ideia de /verdade/ em Majestic Lisp -- mas, de
maneira geral, tudo que não for ~nil~ é tratado como /verdade/.

Números,  apesar de  pertencerem  ao seu  próprio  tipo, poderiam  ser
pensados sintaticamente como símbolos autointerpretáveis que designam,
axiomaticamente, seu próprio valor.

** Cons

O /cons/ (ou  célula /cons/)[fn:7] é um /par de  valores/.  Essa definição é
propositalmente vaga:  os componentes  de um  /cons/ podem  ser qualquer
outro tipo  de valor, inclusive  outros /cons/. Dessa forma,  fica claro
que este tipo tem a função de /combinar/ valores em Majestic Lisp.

Há várias  formas de  criar um  /cons/. Uma delas  é através  do próprio
processo de /quoting/. Por exemplo, para criarmos um par com os símbolos
~a~ e ~b~,  podemos usar uma notação em que  colocamos estes dois símbolos
entre parênteses, separados por um ponto.

#+begin_src majestic
'(a . b)
#+end_src

#+RESULTS[1ebe55b43fc9ddf24df49a2edf253ca361051b9f]:
: (a . b)

Um /cons/  sempre estará  estaticamente escrito  como uma  combinação de
dois elementos separados por ponto, e unidos entre parênteses.

Aqui podemos  também ver  uma propriedade do  processo de  /quoting/: ao
/quotarmos/ um /cons/,  os elementos que o compõem  também serão quotados,
recursivamente.

Podemos, por exemplo, construir um  /cons/ onde o primeiro elemento seja
outro /cons/, e o segundo, seja o símbolo ~c~.

#+begin_src majestic
'((a . b) . c)
#+end_src

#+RESULTS[3aac76d9512ead6e5f8e33e4a84400f0cb1914b5]:
: ((a . b) . c)

Os componentes  de um /cons/  possuem nomes, por influência  da história
dos dialetos  de Lisp. Ao primeiro  elemento, damos o nome  /car/ (lê-se
/cár/); ao segundo  elemento, damos o nome /cdr/  (lê-se /coul-der/). Assim,
em ~(a . b)~, ~a~  é o /car/, e ~b~ é o /cdr/. Podemos  dar outros nomes a essas
partes, mas isso será melhor compreendido posteriormente.

** Streams

/Streams/ são objetos  abstratos de Majestic Lisp,  usados para designar
fluxos por onde informações passam.  Esses fluxos podem ser de /entrada/
ou  /saída/, e  podem designar  /arquivos/ no  sistema, o  fluxo por  onde
recebe-se a informação digitada pelo usuário, ou até mesmo o fluxo por
onde imprime-se a informação, de modo que ela seja mostrada na tela.

Estes dois /streams/  são conhecidos como variáveis  na linguagem, sendo
eles respectivamente ~*stdin*~ e ~*stdout*~.

/Streams/ não possuem uma representação sintática e só podem ser abertos
ou fechados por intermédio de funções.

#+begin_src majestic :eval no
(def stream (open-stream 'out "/home/alchemist/testando.txt"))
(write-string "Teste" stream)
(close-stream stream)
#+end_src

#+RESULTS[1485b9e1a8e450099621dc9ccc41a47415858e9d]:
: t

