02-01-expressoes-primitivas.html

<div id="outline-container-orgfebca4e" class="outline-2">
<h2 id="orgfebca4e"><span class="section-number-2">3.</span> Símbolos e <i>Quoting</i></h2>
<div class="outline-text-2" id="text-3">
<p>
Antes de falarmos do tipo  mais fundamental (e talvez mais importante)
não apenas de Majestic Lisp, mas  talvez de todos os Lisps, precisamos
falar do processo de <i>quoting</i>.
</p>

<p>
<i>Quoting</i>, palavra em  Inglês também conhecida como <i>citação</i>,  é o nome
que damos ao ato de fornecer certas expressões para o interpretador de
Majestic Lisp,  <b>sem que o interpretador  efetivamente interprete essas
expressões</b>.   Em outras  palavras,  é como  fornecer  um valor  "entre
aspas".
</p>

<p>
O interpretador  de um  dialeto de  Lisp tem a  missão de  receber uma
expressão,  interpretá-la  e assim  retornar  ao  usuário o  valor  da
mesma. Assim, escrever uma expressão como  <code>-5</code> passa por um processo de
interpretação, em que identifica-se que aquilo  é um número, e o valor
de tal número é retornado ao usuário.
</p>

<div class="org-src-container">
<pre class="src src-majestic">-5
</pre>
</div>

<pre class="example">
-5
</pre>


<p>
Quando a  expressão em questão  não é um  <i>número</i> ou um  <i>caractere</i>, ela
pode ser um  <i>símbolo</i>. E normalmente, símbolos  funcionam como <i>rótulos</i>:
eles estarão  associados a um <i>valor</i>  em algum tipo de  <i>tabela</i> que, por
enquanto, não é muito relevante conhecermos.
</p>

<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #dcdcaa;">eq</span>
</pre>
</div>

<pre class="example">
#&lt;function (prim eq (arity (required 2)))&gt;
</pre>


<p>
Quando um <i>símbolo</i> (como <code>eq</code>) é fornecido ao interpretador, este tentará
buscar o valor <b>associado</b> a esse  símbolo (nesse caso, uma função, algo
que  conheceremos mais  adiante).  Se o  nosso  objetivo fosse  tratar
apenas do próprio símbolo  <code>eq</code>, então precisaríamos <i>quotá-lo</i>, colocando
um apóstrofo antes de escrevê-lo:
</p>

<div class="org-src-container">
<pre class="src src-majestic">'<span style="color: #dcdcaa;">eq</span>
</pre>
</div>

<pre class="example">
eq
</pre>


<p>
Ao  <i>quotarmos</i> um  certo  símbolo  ou um  outro  tipo  de expressão,  o
interpretador  entenderá que  não  deve processar  o conteúdo  daquela
expressão,  mas  sim retorná-la  da  forma  como  está escrita.  Se  a
expressão  quotada  for  um  <i>símbolo</i>, portanto,  aquele  símbolo  será
retornado.
</p>
</div>

<div id="outline-container-org054940e" class="outline-3">
<h3 id="org054940e"><span class="section-number-3">3.1.</span> Símbolos comuns</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Símbolos, como já foi dito antes,  operam como <i>rótulos</i> para valores na
linguagem, mas  eles em si  são também um  tipo especial de  valor. Um
símbolo   é  representado,   textualmente,   como   uma  palavra   sem
espaços.
</p>

<p>
Tratar  símbolos   diretamente  com  valores   frequentemente  exigirá
<i>quotá-los</i>, com algumas raras exceções, que veremos em breve.
</p>

<div class="org-src-container">
<pre class="src src-majestic">'foo
</pre>
</div>

<pre class="example">
foo
</pre>


<div class="org-src-container">
<pre class="src src-majestic">'bar
</pre>
</div>

<pre class="example">
bar
</pre>


<p>
Normalmente separamos as "palavras" de  um símbolo com hífens <code>-</code>, sendo
esta uma convenção de quase todos os dialetos de Lisp, algo que também
adotaremos aqui.
</p>

<div class="org-src-container">
<pre class="src src-majestic">'fulano-de-tal
</pre>
</div>

<pre class="example">
fulano-de-tal
</pre>
</div>
</div>

<div id="outline-container-org14ce450" class="outline-3">
<h3 id="org14ce450"><span class="section-number-3">3.2.</span> Símbolos autointerpretáveis</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Alguns  poucos símbolos  são  <i>autointerpretáveis</i>, isto  é, não  exigem
nenhum tipo  de <i>quoting</i>, pois  o único valor  associado a eles  é eles
mesmos.
</p>

<p>
Esses  símbolos (como  <code>t</code> e  <code>nil</code>) normalmente  possuem uso  especial, e
podem ser considerados como <i>axiomas</i><sup><a id="fnr.4" class="footref" href="#fn.4" role="doc-backlink">4</a></sup> da linguagem.
</p>

<div class="org-src-container">
<pre class="src src-majestic">t
</pre>
</div>

<pre class="example">
t
</pre>


<div class="org-src-container">
<pre class="src src-majestic">nil
</pre>
</div>

<pre class="example">
nil
</pre>


<p>
<code>nil</code> é o  símbolo geral para denotar  <i>falsidade</i> ou o fim  de uma <i>lista</i>,
que veremos em uma  situação mais adiante. Já o símbolo  <code>t</code> é o símbolo
específico para denotar a ideia de <i>verdade</i> em Majestic Lisp &#x2013; mas, de
maneira geral, tudo que não for <code>nil</code> é tratado como <i>verdade</i>.
</p>

<p>
Números,  apesar de  pertencerem  ao seu  próprio  tipo, poderiam  ser
pensados sintaticamente como símbolos autointerpretáveis que designam,
axiomaticamente, seu próprio valor.
</p>
</div>
</div>
</div>

<div id="outline-container-orgea04ef9" class="outline-2">
<h2 id="orgea04ef9"><span class="section-number-2">4.</span> Cons</h2>
<div class="outline-text-2" id="text-4">
<p>
O <i>cons</i> (ou  célula <i>cons</i>)<sup><a id="fnr.5" class="footref" href="#fn.5" role="doc-backlink">5</a></sup> é um <i>par de  valores</i>.  Essa definição é
propositalmente vaga:  os componentes  de um  <i>cons</i> podem  ser qualquer
outro tipo  de valor, inclusive  outros <i>cons</i>. Dessa forma,  fica claro
que este tipo tem a função de <i>combinar</i> valores em Majestic Lisp.
</p>

<p>
Há várias  formas de  criar um  <i>cons</i>. Uma delas  é através  do próprio
processo de <i>quoting</i>. Por exemplo, para criarmos um par com os símbolos
<code>a</code> e <code>b</code>,  podemos usar uma notação em que  colocamos estes dois símbolos
entre parênteses, separados por um ponto.
</p>

<div class="org-src-container">
<pre class="src src-majestic">'<span style="color: #ffd700;">(</span>a . b<span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
(a . b)
</pre>


<p>
Um <i>cons</i>  sempre estará  estaticamente escrito  como uma  combinação de
dois elementos separados por ponto, e unidos entre parênteses.
</p>

<p>
Aqui podemos  também ver  uma propriedade do  processo de  <i>quoting</i>: ao
<i>quotarmos</i> um <i>cons</i>,  os elementos que o compõem  também serão quotados,
recursivamente.
</p>

<p>
Podemos, por exemplo, construir um  <i>cons</i> onde o primeiro elemento seja
outro <i>cons</i>, e o segundo, seja o símbolo <code>c</code>.
</p>

<div class="org-src-container">
<pre class="src src-majestic">'<span style="color: #ffd700;">(</span><span style="color: #da70d6;">(</span>a . b<span style="color: #da70d6;">)</span> . c<span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
((a . b) . c)
</pre>


<p>
Os componentes  de um <i>cons</i>  possuem nomes, por influência  da história
dos dialetos  de Lisp. Ao primeiro  elemento, damos o nome  <i>car</i> (lê-se
<i>cár</i>); ao segundo  elemento, damos o nome <i>cdr</i>  (lê-se <i>coul-der</i>). Assim,
em <code>(a . b)</code>, <code>a</code>  é o <i>car</i>, e <code>b</code> é o <i>cdr</i>. Podemos  dar outros nomes a essas
partes, mas isso será melhor compreendido posteriormente.
</p>
</div>
</div>

<div id="outline-container-orgfeecc95" class="outline-2">
<h2 id="orgfeecc95"><span class="section-number-2">5.</span> Streams</h2>
<div class="outline-text-2" id="text-5">
<p>
<i>Streams</i> são objetos  abstratos de Majestic Lisp,  usados para designar
fluxos por onde informações passam.  Esses fluxos podem ser de <i>entrada</i>
ou  <i>saída</i>, e  podem designar  <i>arquivos</i> no  sistema, o  fluxo por  onde
recebe-se a informação digitada pelo usuário, ou até mesmo o fluxo por
onde imprime-se a informação, de modo que ela seja mostrada na tela.
</p>

<p>
Estes dois <i>streams</i>  são conhecidos como variáveis  na linguagem, sendo
eles respectivamente <code>*stdin*</code> e <code>*stdout*</code>.
</p>

<p>
<i>Streams</i> não possuem uma representação sintática e só podem ser abertos
ou fechados por intermédio de funções.
</p>

<div class="org-src-container">
<pre class="src src-majestic"><span style="color: #ffd700;">(</span><span style="color: #569cd6;">def</span> stream <span style="color: #da70d6;">(</span><span style="color: #dcdcaa;">open-stream</span> 'out <span style="color: #ce9178;">"/home/alchemist/testando.txt"</span><span style="color: #da70d6;">)</span><span style="color: #ffd700;">)</span>
<span style="color: #ffd700;">(</span><span style="color: #dcdcaa;">write-string</span> <span style="color: #ce9178;">"Teste"</span> stream<span style="color: #ffd700;">)</span>
<span style="color: #ffd700;">(</span><span style="color: #dcdcaa;">close-stream</span> stream<span style="color: #ffd700;">)</span>
</pre>
</div>

<pre class="example">
t
</pre>
</div>
</div>
