02-01-expressoes-primitivas.org
* Footnotes

[fn:7] O nome "cons" advém de "construção", ou /construct/ em Inglês.

[fn:4]  Matematicamente,  um  /axioma/   é  uma  regra  autoevidente  ou
universalmente aceita,  ou uma regra/princípio/lei estabelecido  em um
sistema.   Aqui, o  comportamento  desses símbolos  é  como uma  regra
estabelecida e universal de Majestic Lisp.

[fn:3] Essa notação foi diretamente importada de dialetos da linguagem
APL, mais especificamente  GNU APL (https://www.gnu.org/software/apl/)
e Dyalog APL (https://www.dyalog.com/).

[fn:2] Ao contrário do que sua péssima escolha de nome sugere, números
imaginários são  tão "reais" quanto  números reais. Esses  números são
utilizados    em     circuitos    elétricos,     eletromagnetismo    e
aerodinâmica.  Mas  há  outras aplicações,  sobretudo  relacionadas  a
trigonometria e situações que envolvam pares de números, por exemplo.

[fn:1]  Uma  fração pode  ser  entendida  como  estando em  sua  /forma
simplificada/ quando  numerador e denominador  são /primos entre  si/, ou
seja, quando não há número que  realize sua divisão inteira, a não ser
o  número 1.  Para chegar  a essa  forma, basta  dividir continuamente
ambos os números pelo /máximo divisor comum/ de ambos.
