02-01-expressoes-primitivas.html
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Uma  fração pode  ser  entendida  como  estando em  sua  <i>forma
simplificada</i> quando  numerador e denominador  são <i>primos entre  si</i>, ou
seja, quando não há número que  realize sua divisão inteira, a não ser
o  número 1.  Para chegar  a essa  forma, basta  dividir continuamente
ambos os números pelo <i>máximo divisor comum</i> de ambos.
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Ao contrário do que sua péssima escolha de nome sugere, números
imaginários são  tão "reais" quanto  números reais. Esses  números são
utilizados    em     circuitos    elétricos,     eletromagnetismo    e
aerodinâmica.  Mas  há  outras aplicações,  sobretudo  relacionadas  a
trigonometria e situações que envolvam pares de números, por exemplo.
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3" role="doc-backlink">3</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Essa notação foi diretamente importada de dialetos da linguagem
APL, mais especificamente  GNU APL (<a href="https://www.gnu.org/software/apl/">https://www.gnu.org/software/apl/</a>)
e Dyalog APL (<a href="https://www.dyalog.com/">https://www.dyalog.com/</a>).
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4" role="doc-backlink">4</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Matematicamente,  um  <i>axioma</i>   é  uma  regra  autoevidente  ou
universalmente aceita,  ou uma regra/princípio/lei estabelecido  em um
sistema.   Aqui, o  comportamento  desses símbolos  é  como uma  regra
estabelecida e universal de Majestic Lisp.
</p></div></div>

<div class="footdef"><sup><a id="fn.5" class="footnum" href="#fnr.5" role="doc-backlink">5</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
O nome "cons" advém de "construção", ou <i>construct</i> em Inglês.
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Lucas S. Vieira</p>
<p class="date">Created: 2022-10-24 seg 00:27</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
